In [1]:
import pandas as pd 
import numpy as np

###### DataFrame.rename(self, mapper=None, index=None, columns=None, axis=None, copy=True, inplace=False, level=None, errors='ignore'

In [2]:
df = pd.DataFrame(np.arange(9).reshape(3,3),index=["ohio","colardo","new york"],columns=["one","two","three"])

In [3]:
df

          one  two  three
ohio        0    1      2
colardo     3    4      5
new york    6    7      8

In [4]:
df.rename(index=str.upper,columns=str.title)

          One  Two  Three
OHIO        0    1      2
COLARDO     3    4      5
NEW YORK    6    7      8

In [5]:
df.rename(index={"ohio":"indianaa"},columns={"two":"peekaboo"})

          one  peekaboo  three
indianaa    0         1      2
colardo     3         4      5
new york    6         7      8

In [6]:
df.rename({"colardo":"ohio"},axis=0)

          one  two  three
ohio        0    1      2
ohio        3    4      5
new york    6    7      8